benchmarks/cospec_benchmark_results_20250522_022446_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_5_0_10_sharegpt_output.txt
INFO 05-22 07:42:14 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.0
Checking server health at http://127.0.0.1:8001/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1727      
Benchmark duration (s):                  300.24    
Total input tokens:                      407730    
Total generated tokens:                  365814    
Request throughput (req/s):              5.75      
Output token throughput (tok/s):         1218.41   
Total Token throughput (tok/s):          2576.44   
---------------Time to First Token----------------
Mean TTFT (ms):                          41097.35  
Median TTFT (ms):                        43198.08  
P99 TTFT (ms):                           101026.65 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          136.99    
Median TPOT (ms):                        110.56    
P99 TPOT (ms):                           407.16    
---------------Inter-token Latency----------------
Mean ITL (ms):                           503.26    
Median ITL (ms):                         481.83    
P99 ITL (ms):                            961.52    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          62430.23  
Median E2EL (ms):                        62113.57  
P99 E2EL (ms):                           141746.86 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 1461.29   
Median Token Latency (ms):               328.82    
P99 Token Latency (ms):                  13413.27  
==================================================