benchmarks/cospec_benchmark_results_20250522_022446_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_7_0_6_sharegpt_output.txt
INFO 05-22 09:08:32 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=6.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.0
Checking server health at http://127.0.0.1:8001/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 6.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1652      
Benchmark duration (s):                  300.23    
Total input tokens:                      383006    
Total generated tokens:                  365326    
Request throughput (req/s):              5.50      
Output token throughput (tok/s):         1216.81   
Total Token throughput (tok/s):          2492.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          202.41    
Median TTFT (ms):                        184.76    
P99 TTFT (ms):                           549.95    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          75.89     
Median TPOT (ms):                        59.59     
P99 TPOT (ms):                           245.33    
---------------Inter-token Latency----------------
Mean ITL (ms):                           321.25    
Median ITL (ms):                         298.97    
P99 ITL (ms):                            723.71    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11572.60  
Median E2EL (ms):                        8331.73   
P99 E2EL (ms):                           52358.21  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 78.67     
Median Token Latency (ms):               61.48     
P99 Token Latency (ms):                  254.02    
==================================================